# 不可用

artifact_name = [
    '磐陀裂生之花',
    '嵯峨群峰之翼',
    '星罗圭璧之晷',
    '巉岩琢塑之樽',
    '不动玄石之相',
    '历经风雪的思念',
    '摧冰而行的执望',
    '冰雪故园的终期',
    '遍结寒霜的傲骨',
    '破冰踏雪的回音',
    '染血的铁之心',
    '染血的黑之羽',
    '骑士染血之时',
    '染血骑士之杯',
    '染血的铁假面',
    '魔女的炎之花',
    '魔女常燃之羽',
    '魔女破灭之时',
    '魔女的心之火',
    '焦灼的魔女帽',
    '角斗士的留恋',
    '角斗士的归宿',
    '角斗士的希冀',
    '角斗士的酣醉',
    '角斗士的凯旋',
    '饰金胸花',
    '追忆之风',
    '坚铜罗盘',
    '沉波之盏',
    '酒渍船帽',
    '渡火者的决绝',
    '渡火者的解脱',
    '渡火者的煎熬',
    '渡火者的醒悟',
    '渡火者的智慧',
    '远方的少女之心',
    '少女飘摇的思念',
    '少女苦短的良辰',
    '少女片刻的闲暇',
    '少女易逝的芳颜',
    '宗室之花',
    '宗室之翎',
    '宗室时计',
    '宗室银瓮',
    '宗室面具',
    '夏祭之花',
    '夏祭终末',
    '夏祭之刻',
    '夏祭水玉',
    '夏祭之面',
    '平雷之心',
    '平雷之羽',
    '平雷之刻',
    '平雷之器',
    '平雷之冠',
    '雷鸟的怜悯',
    '雷灾的孑遗',
    '雷霆的时计',
    '降雷的凶兆',
    '唤雷的头冠',
    '野花记忆的绿野',
    '猎人青翠的箭羽',
    '翠绿猎人的笃定',
    '翠绿猎人的容器',
    '翠绿的猎人之冠',
    '乐团的晨光',
    '琴师的箭羽',
    '终幕的时计',
    '吟游者之壶',
    '指挥的礼帽',
    '战狂的蔷薇',
    '战狂的翎羽',
    '战狂的时计',
    '战狂的骨杯',
    '战狂的鬼面',
    '勇士的勋章',
    '勇士的期许',
    '勇士的坚毅',
    '勇士的壮行',
    '勇士的冠冕',
    '守护之花',
    '守护徽印',
    '守护座钟',
    '守护之皿',
    '守护束带',
    '流放者之花',
    '流放者之羽',
    '流放者怀表',
    '流放者之杯',
    '流放者头冠',
    '赌徒的胸花',
    '赌徒的羽饰',
    '赌徒的怀表',
    '赌徒的骰盅',
    '赌徒的耳环',
    '教官的胸花',
    '教官的羽饰',
    '教官的怀表',
    '教官的茶杯',
    '教官的帽子',
    '武人的红花',
    '武人的羽饰',
    '武人的水漏',
    '武人的酒杯',
    '武人的头巾',
    '祭水礼冠',
    '祭火礼冠',
    '祭雷礼冠',
    '祭冰礼冠',
    '故人之心',
    '归乡之羽',
    '逐光之石',
    '异国之盏',
    '感别之冠',
    '学士的书签',
    '学士的羽笔',
    '学士的时钟',
    '学士的墨杯',
    '学士的镜片',
    '奇迹之花',
    '奇迹之羽',
    '奇迹之沙',
    '奇迹之杯',
    '奇迹耳坠',
    '冒险家之花',
    '冒险家尾羽',
    '冒险家怀表',
    '冒险家金杯',
    '冒险家头带',
    '幸运儿绿花',
    '幸运儿鹰羽',
    '幸运儿沙漏',
    '幸运儿之杯',
    '幸运儿银冠',
    '游医的银莲',
    '游医的枭羽',
    '游医的怀钟',
    '游医的药壶',
    '游医的方巾',
    '勋绩之花',
    '昭武翎羽',
    '金铜时晷',
    '盟誓金爵',
    '将帅兜鍪',
    '无垢之花',
    '贤医之羽',
    '停摆之刻',
    '超越之盏',
    '嗤笑之面',
    '明威之镡',
    '切落之羽',
    '雷云之笼',
    '绯花之壶',
    '华饰之兜',
    '羁缠之花',
    '思忆之矢',
    '朝露之时',
    '祈望之心',
    '无常之面',
    '荣花之期',
    '华馆之羽',
    '众生之谣',
    '梦醒之瓢',
    '形骸之笠',
    '海染之花',
    '渊宫之羽',
    '离别之贝',
    '真珠之笼',
    '海祇之冠',
    '魂香之花',
    '祝祀之凭',
    '垂玉之叶',
    '涌泉之盏',
    '浮溯之珏',
    '生灵之华',
    '阳辔之遗',
    '潜光片羽',
    '结契之刻',
    '虺雷之姿',
    # 深林的记忆
    '月桂的宝冠',
    '翠蔓的智者',
    '迷宫的游人',
    '贤智的定期',
    '迷误者之灯',
    # 饰金之梦
    '沙王的投影',
    '裁断的翎羽',
    '梦中的铁花',
    '沉金的岁月',
    '如蜜的终宴',
    # 沙上楼阁史话
    '流沙贵嗣的遗宝',
    '黄金邦国的结末',
    '众王之都的开端',
    '失落迷途的机芯',
    '迷醉长梦的守护',
    # 乐园遗落之花
    '紫晶的花冠',
    '谢落的筵席',
    '月女的华彩',
    '凝结的时刻',
    '守秘的魔瓶',
    # 水仙之梦
    '恶龙的单片镜',
    '坏巫师的羽杖',
    '旅途中的鲜花',
    '水仙的时时刻刻',
    '勇者们的茶会',
    # 花海甘露之光
    '灵光明烁之心',
    '琦色灵彩之羽',
    '灵光源起之蕊',
    '久远花落之时',
    '无边酣乐之筵',
]

material_names = ['璀璨原钻', '燃愿玛瑙', '哀叙冰玉', '坚牢黄玉', '涤净青金', '最胜紫晶', '自在松石', '东风之爪', '东风之翎', '东风的吐息', '北风之尾', '北风之环', '北风的魂匣', '凛风奔狼的怀乡', '狮牙斗士的理想', '高塔孤王的碎梦', '漆黑陨铁的一块', '孤云寒林的神体', '雾海云间的转还', '原石', '创世结晶', '智识之冕', '吞天之鲸·只角', '魔王之刃·残片', '武炼之魂·孤影', '龙王之冕', '血玉之枝', '鎏金之鳞', '远海夷地的金枝', '鸣神御灵的勇武', '今昔剧画之鬼人', '灰烬之心', '狱火之蝶', '熔毁之刻', '万劫之真意', '祸神之禊泪', '凶将之手眼', '生长碧翡', '谧林涓露的金符', '绿洲花园的真谛', '烈日威权的旧日', '傀儡的悬丝', '无心的渊镜', '空行的虚铃', '生长天地之蕨草', '原初绿洲之初绽', '亘古树海之一瞬', '大英雄的经验', '璀璨原钻块', '燃愿玛瑙块', '哀叙冰玉块', '坚牢黄玉块', '涤净青金块', '最胜紫晶块', '自在松石块', '「自由」的哲学', '「抗争」的哲学', '「诗文」的哲学', '「繁荣」的哲学', '「勤劳」的哲学', '「黄金」的哲学', '净水之心', '常燃火种', '极寒之核', '雷光棱镜', '飓风之种', '玄岩之塔', '黑晶号角', '地脉的新芽', '混沌炉心', '雾虚灯芯', '督察长祭刀', '狮牙斗士的镣铐', '高塔孤王的断片', '漆黑陨铁的一角', '孤云寒林的圣骸', '雾海云间的金丹', '凛风奔狼的断牙', '北陆单手剑原胚', '北陆双手剑原胚', '北陆弓原胚', '北陆法器原胚', '北陆长柄武器原胚', '石化的骨片', '腐殖龙髓', '未熟之玉', '霄灯', '「看得见的风」', '晶凝之华', '「童真的断篇」', '魔偶机心', '混沌真眼', '偏光棱镜', '恒常机关之心', '「风雅」的哲学', '「浮世」的哲学', '「天光」的哲学', '远海夷地的琼枝', '鸣神御灵的亲爱', '今昔剧画之一角', '阴燃之珠', '雷霆数珠', '排异之露', '赤穗酒枡', '海皇香脂', '隐兽鬼爪', '兽境王器', '「溶媒」', '龙嗣伪鳍', '明目之油膏', '幽邃刻像', '符纹之齿', '霞色宝珠', '生长碧翡块', '「笃行」的哲学', '「诤言」的哲学', '「巧思」的哲学', '茁壮菌核', '混沌锚栓', '谧林涓露的银符', '绿洲花园的哀思', '烈日威权的梦想', '藏雷野实', '蕈王钩喙', '央陆单手剑原胚', '央陆双手剑原胚', '央陆长柄武器原胚', '央陆法器原胚', '央陆弓原胚', '原海鱼油', '迁风的苍翎', '辉光棱晶', '导光四面体', '永续机芯', '灭诤草蔓', '若狭的藁末', '苍砾蕊羽', '锲纹的横脊', '「不凋的绢华」', '常暗圆环', '漫游者的盛放之花', '凝恒的脂蜡', '冒险家的经验', '璀璨原钻断片', '燃愿玛瑙断片', '哀叙冰玉断片', '坚牢黄玉断片', '涤净青金断片', '最胜紫晶断片', '自在松石断片', '「自由」的指引', '「抗争」的指引', '「诗文」的指引', '「繁荣」的指引', '「勤劳」的指引', '「黄金」的指引', '精锻用魔矿', '攫金鸦印', '禁咒绘卷', '历战的箭簇', '史莱姆原浆', '黑铜号角', '地脉的枯叶', '混沌回路', '雾虚草囊', '特工祭刀', '尉官的徽记', '凛风奔狼的裂齿', '狮牙斗士的铁链', '高塔孤王的残垣', '漆黑陨铁的一片', '孤云寒林的辉岩', '雾海云间的汞丹', '结实的骨片', '原素花蜜', '摩拉', '冒险阅历', '不祥的面具', '纪行经验', '好感经验', '角色经验', '霜噬碎屑', '霜噬结晶', '声望经验·蒙德', '声望经验·璃月', '浮生石片', '灯纸纤维', '灯芯绒材', '节庆热度', '洞天宝钱', '名刀镡', '混沌枢纽', '水晶棱镜', '「风雅」的指引', '「浮世」的指引', '「天光」的指引', '远海夷地的玉枝', '鸣神御灵的欢喜', '今昔剧画之虎啮', '浮游晶化核', '逐月节节庆热度', '隐兽利爪', '声望经验·稻妻', '夤夜刻像', '孢囊晶尘', '休眠菌核', '生长碧翡断片', '「笃行」的指引', '「诤言」的指引', '「巧思」的指引', '混沌模块', '织金红绸', '谧林涓露的铁符', '绿洲花园的恩惠', '烈日威权的余光', '声望经验·须弥', '混浊棱晶', '归风佳酿节节庆热度', '牌手经验', '密固的横脊', '节庆热度（「磬弦奏华夜」）', '何人所珍藏之花', '游乐会热度', '流浪者的经验', '璀璨原钻碎屑', '燃愿玛瑙碎屑', '哀叙冰玉碎屑', '坚牢黄玉碎屑', '涤净青金碎屑', '最胜紫晶碎屑', '自在松石碎屑', '「自由」的教导', '「抗争」的教导', '「诗文」的教导', '「繁荣」的教导', '「勤劳」的教导', '「黄金」的教导', '精锻用良矿', '藏银鸦印', '封魔绘卷', '锐利的箭簇', '污秽的面具', '史莱姆清', '沉重号角', '地脉的旧枝', '混沌装置', '雾虚花粉', '猎兵祭刀', '士官的徽记', '凛风奔狼的始龀', '狮牙斗士的枷锁', '高塔孤王的破瓦', '漆黑陨铁的一粒', '孤云寒林的光砂', '雾海云间的铅丹', '塞西莉亚花', '脆弱的骨片', '微光花蜜', '影打刀镡', '混沌机关', '黯淡棱镜', '「风雅」的教导', '「浮世」的教导', '「天光」的教导', '远海夷地的瑚枝', '鸣神御灵的明惠', '浮游幽核', '果酿饵', '赤糜饵', '蠕虫假饵', '飞蝇假饵', '荧草饵', '隐兽指爪', '晦暗刻像', '荧光孢粉', '失活菌核', '生长碧翡碎屑', '「笃行」的教导', '「诤言」的教导', '「巧思」的教导', '混沌容器', '镶边红绸', '谧林涓露的铜符', '绿洲花园的追忆', '烈日威权的残响', '甘露饵', '破缺棱晶', '今昔剧画之恶尉', '残毁的横脊', '来自何处的待放之花', '史莱姆凝液', '铁块', '新兵的徽记', '夜泊石', '精锻用杂矿', '兽肉', '寻宝鸦印', '导能绘卷', '牢固的箭簇', '破损的面具', '甜甜花', '胡萝卜', '蘑菇', '松茸', '绝云椒椒', '禽肉', '胡椒', '松果', '土豆', '果酱', '鱼肉', '盐', '金鱼草', '豆腐', '莲蓬', '牛奶', '糖', '杏仁', '火腿', '培根', '香肠', '薄荷', '蟹黄', '奶油', '卷心菜', '面粉', '奶酪', '黄油', '虾仁', '番茄', '洋葱', '鸟蛋', '树莓', '小麦', '白萝卜', '螃蟹', '稻米', '嘟嘟莲', '熏禽肉', '落落莓', '小灯草', '慕风蘑菇', '蒲公英籽', '钩钩果', '风车菊', '霓裳花', '琉璃百合', '清心', '星螺', '琉璃袋', '石珀', '白铁块', '水晶块', '马尾', '冰雾花花朵', '烈焰花花蕊', '电气水晶', '蝴蝶翅膀', '青蛙', '发光髓', '蜥蜴尾巴', '晶核', '骗骗花蜜', '苹果', '日落果', '竹笋', '星银矿石', '「冷鲜肉」', '桦木', '却砂木', '杉木', '垂香木', '竹节', '松木', '萃华木', '布匹', '红色染料', '黄色染料', '蓝色染料', '海灵芝', '绯樱绣球', '鸣草', '紫晶块', '海草', '堇瓜', '破旧的刀镡', '鬼兜虫', '晶化骨髓', '血斛', '「薄荷」的种子', '「霓裳花」的种子', '「金鱼草」的种子', '「白萝卜」的种子', '「甜甜花」的种子', '「风车菊」的种子', '「琉璃百合」的种子', '「落落莓」的种子', '「小灯草」的种子', '「马尾」的种子', '「莲蓬」的种子', '「嘟嘟莲」的种子', '「塞西莉亚花」的种子', '「清心」的种子', '「绝云椒椒」的种子', '「胡萝卜」的种子', '「海草」的种子', '「琉璃袋」的种子', '「鸣草」的种子', '「蘑菇」的孢子', '「海灵芝」的样本', '孔雀木', '御伽木', '梦见木', '枫木', '天云草实', '鳗肉', '浮游干核', '珊瑚真珠', '「梦里花·星槿」的花种', '「梦里花·棠铃」的花种', '「梦里花·绣荚」的花种', '幽灯蕈', '星蕈', '蕈兽孢子', '树王圣体菇', '褪色红绸', '秃秃豆', '月莲', '劫波莲', '帕蒂沙兰', '墩墩桃', '须弥蔷薇', '香辛果', '香辛料', '枯焦的星蕈', '活化的星蕈', '辉木', '业果木', '证悟木', '毗波耶', '枣椰', '「香辛果」的种子', '「墩墩桃」的种子', '「须弥蔷薇」的种子', '圣金虫', '赤念果', '刺葵木', '柽木', '沙脂蛹', '神秘的肉', '神秘的肉加工产物', '咖啡豆', '万相石', '悼灵花', '鳅鳅宝玉', '魔晶块', '奇异的「牙齿」', '汲取了生命力的龙牙']


lexicon = set({})
for name in material_names:
    for char in name:
        lexicon.add(char)
for name in artifact_name:
    for char in name:
        lexicon.add(char)

lexicon = sorted(list(lexicon))


# generate torch training data

import cv2
import pickle
from PIL import Image

import torch
import torch.nn as nn
import torchvision.transforms as transforms

x = pickle.load(open('x.pk', 'rb'))
y = pickle.load(open('y.pk', 'rb'))
assert(len(x) == len(y))
n = len(x)

#  validate lexicon
not_in_lexicon = set()
for text in y:
    for chr in text:
        if chr not in lexicon:
            not_in_lexicon.add(chr)

print(not_in_lexicon)
# {'烹', '读', '详', '饪', '召', '铭', '谷'}
exit()

xx = []
yy = []

root_path = 'dumps/'
for cnt in range(n):
    text = y[cnt]
    
    for chr in text:
        if chr in not_in_lexicon:
            continue
    img = cv2.imread(f"{root_path}{x[cnt]}_raw.jpg")
    img = cv2.resize(img, (145, 32))
    img = cv2.cvtColor(img, cv2.COLOR_BGR2GRAY)
    img = cv2.threshold(img, 0, 255, cv2.THRESH_OTSU)[1]
    if text == '':
        # print(img.shape)
        img1 = cv2.copyMakeBorder(img, 0,0,0,384-145, cv2.BORDER_CONSTANT, value=0)
        img2 = cv2.copyMakeBorder(img, 0,0,0,384-145, cv2.BORDER_CONSTANT, value=255)
        img3 = cv2.copyMakeBorder(img, 0,0,0,384-145, cv2.BORDER_DEFAULT, value=0)
        img4 = cv2.copyMakeBorder(img, 0,0,0,384-145, cv2.BORDER_REFLECT, value=0)
        img5 = cv2.copyMakeBorder(img, 0,0,0,384-145, cv2.BORDER_REPLICATE, value=0)
        for i in range(1, 6):
            img = eval(f"img{i}")
            tensor = transforms.ToTensor()(img)
            tensor = torch.unsqueeze(tensor, dim=0)
            xx.append(tensor)
            yy.append(text)
    else:

        img1 = cv2.copyMakeBorder(img, 0,0,0,384-145, cv2.BORDER_CONSTANT, value=0)
        img2 = cv2.copyMakeBorder(img, 0,0,0,384-145, cv2.BORDER_CONSTANT, value=255)
        for i in range(1, 3):
            img = eval(f"img{i}")
            tensor = transforms.ToTensor()(img)
            tensor = torch.unsqueeze(tensor, dim=0)
            xx.append(tensor)
            yy.append(text)
    if cnt%100 == 0:
        print(cnt)
print(len(xx))
xxx = torch.cat(xx, dim=0)
torch.save(xxx, 'genshin_x.pt')
torch.save(yy, 'genshin_y.pt')